Revit 2015 API
DefaultDivideSettings.GetNumber Method
 Gets the default Divided Surface number for a fixed number layout for U or V gridlines. This method is obsolete in Revit 2015. Use getSurfaceNumber instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public int GetNumber(
	UVGridlineType gridlines
)
Visual Basic
<ObsoleteAttribute> _
Public Function GetNumber ( _
	gridlines As UVGridlineType _
) As Integer
Visual C++
[ObsoleteAttribute]
public:
int GetNumber(
	UVGridlineType gridlines
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
Return Value
 The default number for a fixed number layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace